# ActualTreadDepth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..ActualTreadDepth Property
MultistoryStairs Class See Also
---
The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double ActualTreadDepth { get; set; }
```

Visual Basic
---
```text
Public Property ActualTreadDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ActualTreadDepth {
	double get ();
	void set (double value);
}
```

# Remarks
In a multistory stairs, all the stairs elements keep the same tread depth parameter value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet. |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace